<!-- dflook/terraform-github-actions {"workspace":"tofu-release-2","backend_type":"remote","backend":"2e9fcc75e2571b7c79c96847f245a612fae3671e508790141f722e625a49eee1","plan_job_ref":"Job Test Terraform cloud #185 at https://github.com/dflook/terraform-github-actions/actions/runs/6645076671","plan_hash":"3565c80bb06555ba8dbe257b38750adf7e97e822f1626e69efb0bdb1f4353b44","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __tofu-release-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #185](https://github.com/dflook/terraform-github-actions/actions/runs/6645076671)